OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1716.h
#define G1BLKF0                 COG1BLKFbits.G1BLKF0            // bit 0
#define G1BLKF1                 COG1BLKFbits.G1BLKF1            // bit 1
#define G1BLKF2                 COG1BLKFbits.G1BLKF2            // bit 2
#define G1BLKF3                 COG1BLKFbits.G1BLKF3            // bit 3
#define G1BLKF4                 COG1BLKFbits.G1BLKF4            // bit 4
#define G1BLKF5                 COG1BLKFbits.G1BLKF5            // bit 5

#define G1BLKR0                 COG1BLKRbits.G1BLKR0            // bit 0
#define G1BLKR1                 COG1BLKRbits.G1BLKR1            // bit 1
#define G1BLKR2                 COG1BLKRbits.G1BLKR2            // bit 2
#define G1BLKR3                 COG1BLKRbits.G1BLKR3            // bit 3
#define G1BLKR4                 COG1BLKRbits.G1BLKR4            // bit 4
#define G1BLKR5                 COG1BLKRbits.G1BLKR5            // bit 5

#define G1MD0                   COG1CON0bits.G1MD0              // bit 0
#define G1MD1                   COG1CON0bits.G1MD1              // bit 1
#define G1MD2                   COG1CON0bits.G1MD2              // bit 2
#define G1CS0                   COG1CON0bits.G1CS0              // bit 3
#define G1CS1                   COG1CON0bits.G1CS1              // bit 4
#define G1LD                    COG1CON0bits.G1LD               // bit 6
#define G1EN                    COG1CON0bits.G1EN               // bit 7

#define G1POLA                  COG1CON1bits.G1POLA             // bit 0
#define G1POLB                  COG1CON1bits.G1POLB             // bit 1
#define G1POLC                  COG1CON1bits.G1POLC             // bit 2
#define G1POLD                  COG1CON1bits.G1POLD             // bit 3
#define G1FDBS                  COG1CON1bits.G1FDBS             // bit 6
#define G1RDBS                  COG1CON1bits.G1RDBS             // bit 7

#define G1DBF0                  COG1DBFbits.G1DBF0              // bit 0
#define G1DBF1                  COG1DBFbits.G1DBF1              // bit 1
#define G1DBF2                  COG1DBFbits.G1DBF2              // bit 2
#define G1DBF3                  COG1DBFbits.G1DBF3              // bit 3
#define G1DBF4                  COG1DBFbits.G1DBF4              // bit 4
#define G1DBF5                  COG1DBFbits.G1DBF5              // bit 5

#define G1DBR0                  COG1DBRbits.G1DBR0              // bit 0
#define G1DBR1                  COG1DBRbits.G1DBR1              // bit 1
#define G1DBR2                  COG1DBRbits.G1DBR2              // bit 2
#define G1DBR3                  COG1DBRbits.G1DBR3              // bit 3
#define G1DBR4                  COG1DBRbits.G1DBR4              // bit 4
#define G1DBR5                  COG1DBRbits.G1DBR5              // bit 5

#define G1FIS0                  COG1FISbits.G1FIS0              // bit 0
#define G1FIS1                  COG1FISbits.G1FIS1              // bit 1
#define G1FIS2                  COG1FISbits.G1FIS2              // bit 2
#define G1FIS3                  COG1FISbits.G1FIS3              // bit 3
#define G1FIS4                  COG1FISbits.G1FIS4              // bit 4
#define G1FIS5                  COG1FISbits.G1FIS5              // bit 5
#define G1FIS6                  COG1FISbits.G1FIS6              // bit 6
#define G1FIS7                  COG1FISbits.G1FIS7              // bit 7

#define G1FSIM0                 COG1FSIMbits.G1FSIM0            // bit 0
#define G1FSIM1                 COG1FSIMbits.G1FSIM1            // bit 1
#define G1FSIM2                 COG1FSIMbits.G1FSIM2            // bit 2
#define G1FSIM3                 COG1FSIMbits.G1FSIM3            // bit 3
#define G1FSIM4                 COG1FSIMbits.G1FSIM4            // bit 4
#define G1FSIM5                 COG1FSIMbits.G1FSIM5            // bit 5
#define G1FSIM6                 COG1FSIMbits.G1FSIM6            // bit 6
#define G1FSIM7                 COG1FSIMbits.G1FSIM7            // bit 7

#define G1PHF0                  COG1PHFbits.G1PHF0              // bit 0
#define G1PHF1                  COG1PHFbits.G1PHF1              // bit 1
#define G1PHF2                  COG1PHFbits.G1PHF2              // bit 2
#define G1PHF3                  COG1PHFbits.G1PHF3              // bit 3
#define G1PHF4                  COG1PHFbits.G1PHF4              // bit 4
#define G1PHF5                  COG1PHFbits.G1PHF5              // bit 5

#define G1PHR0                  COG1PHRbits.G1PHR0              // bit 0
#define G1PHR1                  COG1PHRbits.G1PHR1              // bit 1
#define G1PHR2                  COG1PHRbits.G1PHR2              // bit 2
#define G1PHR3                  COG1PHRbits.G1PHR3              // bit 3
#define G1PHR4                  COG1PHRbits.G1PHR4              // bit 4
#define G1PHR5                  COG1PHRbits.G1PHR5              // bit 5

#define G1RIS0                  COG1RISbits.G1RIS0              // bit 0
#define G1RIS1                  COG1RISbits.G1RIS1              // bit 1
#define G1RIS2                  COG1RISbits.G1RIS2              // bit 2
#define G1RIS3                  COG1RISbits.G1RIS3              // bit 3
#define G1RIS4                  COG1RISbits.G1RIS4              // bit 4
#define G1RIS5                  COG1RISbits.G1RIS5              // bit 5
#define G1RIS6                  COG1RISbits.G1RIS6              // bit 6
#define G1RIS7                  COG1RISbits.G1RIS7              // bit 7

#define G1RSIM0                 COG1RSIMbits.G1RSIM0            // bit 0
#define G1RSIM1                 COG1RSIMbits.G1RSIM1            // bit 1
#define G1RSIM2                 COG1RSIMbits.G1RSIM2            // bit 2
#define G1RSIM3                 COG1RSIMbits.G1RSIM3            // bit 3
#define G1RSIM4                 COG1RSIMbits.G1RSIM4            // bit 4
#define G1RSIM5                 COG1RSIMbits.G1RSIM5            // bit 5
#define G1RSIM6                 COG1RSIMbits.G1RSIM6            // bit 6
#define G1RSIM7                 COG1RSIMbits.G1RSIM7            // bit 7

#define G1STRA                  COG1STRbits.G1STRA              // bit 0
#define G1STRB                  COG1STRbits.G1STRB              // bit 1
#define G1STRC                  COG1STRbits.G1STRC              // bit 2
#define G1STRD                  COG1STRbits.G1STRD              // bit 3
#define G1SDATA                 COG1STRbits.G1SDATA             // bit 4
#define G1SDATB                 COG1STRbits.G1SDATB             // bit 5
#define G1SDATC                 COG1STRbits.G1SDATC             // bit 6
#define G1SDATD                 COG1STRbits.G1SDATD             // bit 7

#define DAC1NSS                 DAC1CON0bits.DAC1NSS            // bit 0, shadows bit in DAC1CON0bits
#define DACNSS                  DAC1CON0bits.DACNSS             // bit 0, shadows bit in DAC1CON0bits
#define DAC1PSS0                DAC1CON0bits.DAC1PSS0           // bit 2, shadows bit in DAC1CON0bits
#define DACPSS0                 DAC1CON0bits.DACPSS0            // bit 2, shadows bit in DAC1CON0bits
#define DAC1PSS1                DAC1CON0bits.DAC1PSS1           // bit 3, shadows bit in DAC1CON0bits
#define DACPSS1                 DAC1CON0bits.DACPSS1            // bit 3, shadows bit in DAC1CON0bits
#define DAC1OE2                 DAC1CON0bits.DAC1OE2            // bit 4, shadows bit in DAC1CON0bits
#define DACOE0                  DAC1CON0bits.DACOE0             // bit 4, shadows bit in DAC1CON0bits
#define DAC1OE1                 DAC1CON0bits.DAC1OE1            // bit 5, shadows bit in DAC1CON0bits
#define DACOE1                  DAC1CON0bits.DACOE1             // bit 5, shadows bit in DAC1CON0bits
#define DAC1EN                  DAC1CON0bits.DAC1EN             // bit 7, shadows bit in DAC1CON0bits
#define DACEN                   DAC1CON0bits.DACEN              // bit 7, shadows bit in DAC1CON0bits

